create_clock -period 10.000 -name clk [get_ports clk]
set_input_delay  -clock clk 2.0 [all_inputs  -filter {NAME != clk}]
set_false_path -to [all_outputs]
set_multicycle_path -setup 2 -from [get_cells -hier -filter {NAME =~ f_reg*}] -to [get_cells -hier -filter {NAME =~ pool1_reg*}]
set_multicycle_path -hold  1 -from [get_cells -hier -filter {NAME =~ f_reg*}] -to [get_cells -hier -filter {NAME =~ pool1_reg*}]
set_multicycle_path -setup 2 -from [get_cells -hier -filter {NAME =~ oh_reg*}] -to [get_cells -hier -filter {NAME =~ fmap1_mem_reg*}]
set_multicycle_path -hold  1 -from [get_cells -hier -filter {NAME =~ oh_reg*}] -to [get_cells -hier -filter {NAME =~ fmap1_mem_reg*}]
set_multicycle_path -setup 2 -from [get_cells -hier -filter {NAME =~ state_reg*}] -to [get_cells -hier -filter {NAME =~ fmap1_mem_reg*}]
set_multicycle_path -hold  1 -from [get_cells -hier -filter {NAME =~ state_reg*}] -to [get_cells -hier -filter {NAME =~ fmap1_mem_reg*}]
